Revit 2026 API

# BuiltInFailuresDividedPathFailures Class

---

Failures related to divided path operations.

SystemObject Autodesk.Revit.DBBuiltInFailuresDividedPathFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class DividedPathFailures
```
```vb
Public NotInheritable Class DividedPathFailures
```
```cpp
public ref class DividedPathFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DividedPathFailures = class end
```

The BuiltInFailuresDividedPathFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DividedPathCannotApplyDivideSettings | Default Divide settings cannot be applied to Divided Path. |
|  | DividedPathCannotBeMirroredWithoutItsCurves | Divided path cannot be mirrored without its curves. |
|  | DividedPathCannotCreateFromGeometry | Highlighted geometry contains a path or edge that could not be divided. |
|  | DividedPathDistanceTooSmall | Distance is too small. |
|  | DividedPathIndentsOverlap | Beginning indent and end indent overlap. |
|  | DividedPathIntersectionPolycurveParamsStepFailed | Intersection failed. |
|  | DividedPathInvalidNumberOfPoints | End indent is too large. |
|  | DividedPathLayoutStepFailed | Layout algorithm failed. |
|  | DividedPathUpdateMergedPointKeysStepFailed | Merging failed. |

#### Reference

Autodesk.Revit.DB Namespace